Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/travel_and_recreation/travel_abroad/general_tips.html.txt.tmx
Source language: en
Languages: ga

source: Travelling abroad: general tips
ga: Taisteal thar lear: comhairle ghinearálta

source: Travelling abroad can be a very worthwhile and rewarding experience
ga: Is féidir le taisteal thar lear a bheith ina eispéireas an-fhiúntach agus luachmhar

source: Whether it's your first time to leave Ireland or you are a seasoned traveller, there are a numer of things you need to consider when you are preparing for travel abroad
ga: Más é do chéad uair ag fágáil na hÉireann nó más taistealaí rialta thú, tá líon rudaí ann nach mór duit machnamh a dhéanamh orthu nuair a bhíonn réiteach á dhéanamh agat chun taisteal thar lear

source: Before you travel abroad
ga: Sula dtaistealaíonn tú thar lear

source: Before you travel, familiarise yourself with your destination
ga: Sula dtaistealaíonn tú, ba cheart duit faisnéis a fháil faoi do cheann scríbe

source: Do you require a visa to travel there?
ga: An bhfuil víosa ag teastáil chun taisteal ann?

source: What is the local currency?
ga: Cad é an t-airgeadra áitiúil?

source: Is there a time difference between your destination and Ireland?
ga: An bhfuil difríocht ama idir do cheann scríbe agus Éire?

source: You can obtain all this information from your travel agent or the embassy of the country concerned in advance
ga: Is féidir an fhaisnéis go léir seo a fháil ó do ghníomhaire taistil nó ó ambasáid na tíre ábhartha roimh ré

source: Alternatively, you can also search for this information online
ga: Ina ionad sin, is féidir leat cuardach a dhéanamh ar an bhfaisnéis seo ar líne

source: Irish citizens travelling abroad should register their contact details with the Department of Foreign Affairs and Trade, particularly if they are travelling to remote destinations or locations where they may be at risk
ga: Ba cheart do shaoránaigh Éireannacha atá ag taisteal thar lear a sonraí teagmhála a chlárú leis an Roinn Gnóthaí Eachtracha agus Trádála, go háirithe má tá siad ag taisteal chuig cinn scríbe iargúlta nó chuig láithreacha ina bhféadfaidís bheith i mbaol

source: With the exception of travel to the UK, Irish citizens require a valid passport in order to travel to every destination
ga: Tá dualgas ar shaoránaigh Éireannacha pas bailí a bheith acu chun taisteal go dtí gach ceann scríbe ach amháin taisteal chuig an RA

source: However, your airline or ferry company will probably require you to have a valid passport
ga: Ar a shon sin, tharlódh go n-iarrfadh d’aerlíne nó do chuideachta farantóireachta ort pas bailí a bheith agat

source: All EU citizens have the right to enter and reside in the territory of any other member state of the European Union for a period of up to three months simply by presenting a valid passport or national identity card; no other formality is required
ga: Tá ag gach saoránach AE limistéir eile an AE a iontráil agus cónaí iontu ar feadh tréimhse uasta trí mhí ach pas bailí nó cárta náisiúnta aitheantais a sholáthar; ní theastaíonn aon ghnás foirmiúil eile

source: Member states cannot set additional conditions concerning the minimum validity of duration of the identity card or passport
ga: Ní féidir le ballstáit coinníollacha breise a shocrú maidir le bailíocht íosta thréimhse an chárta aitheantais nó an phas

source: Irish citizens travelling to destinations outside the EU are subject to the specific passport controls and requirements of those countries
ga: Tá saoránaigh Éireannacha a thaistealaíonn chuig cinn scríbe lasmuigh den AE faoi réir rialuithe agus riachtanais shonracha phas na dtíortha sin

source: This means, for example, when travelling outside the EU, your passport may need to be valid for a certain period
ga: Ciallaíonn seo, mar shampla, nuair a bhítear ag taisteal lasmuigh den AE, tharlódh go mbeadh ar do phas bheith bailí ar feadh tréimhse áirithe

source: Remember, you can renew your Irish passport at any time - you don't have to wait until your passport is about to expire to do so
ga: Cuimhnigh gur féidir do phas Éireannach a athnuachan aon tráth – ní gá fanacht go dtí go bhfuil do phas ar tí bheith éagtha chun amhlaidh a dhéanamh

source: Read more information on applying for a passport in our document on applying for an Irish passport
ga: Is féidir tuilleadh faisnéise faoi iarratas a dhéanamh ar phas a léamh inár gcáipéis Iarratas a dhéanamh ar phas Éireannach

source: Irish passport holders require an electronic travel authorization (ESTA) before boarding their flight to the US
ga: Teastaíonn údarú leictreonach taistil (ESTA) ó shealbhóirí pasanna Éireannacha sula ndéanann siad a eitilt chuig SAM a bhordáil

source: Whether or not you will require a visa when travelling abroad depends on your destination
ga: Braitheann cibé acu an dteastóidh nó nach dteastóidh víosa uait agus tú ag taisteal thar lear ar do cheann scríbe

source: Your travel agent or the embassy of the country you will be visiting can advise on this
ga: Féadfaidh do ghníomhaire taistil nó ambasáid na tíre a mbeidh cuairt á tabhairt agat uirthi comhairle a chur ort ina thaobh seo

source: If you are travelling to a destination within the EU, you are entitled to receive emergency medical treatment on the same basis as a national of that country
ga: Má tá tú ag taisteal chuig ceann scríbe laistigh den AE, tá tú i dteideal cóireáil leighis éigeandála a fháil ar an mbunús céanna le náisiúnach na tíre sin

source: You must have your European Health Insurance Card with you
ga: Ní mór go mbeidh do Chárta Eorpach um Árachas Sláinte leat

source: If you will be travelling abroad for an extended period, you should consider consulting your doctor to discuss known or possible health risks
ga: Má bheidh tú ag taisteal thar lear ar feadh tréimhse fhada, ba cheart duit machnamh a dhéanamh ar dhul i gcomhairle le do dhochtúir chun baol feasach nó féideartha sláinte a phlé atá sa tír sin

source: This is particularly important if you have an existing medical condition or are visiting a tropical area where the conditions exist for the spread of infectious diseases
ga: Tá sé seo an-tábhachtach má tá riocht sláinte ort cheana féin nó má tá cuairt á tabhairt agat ar cheantar teochriosach ina bhfuil coinníollacha do leathadh na ngalar tógálach

source: There is more information in our document on health issues when travelling abroad
ga: Is féidir leat níos mó a léamh faoi seo inár gcáipéis ar shaincheisteanna sláinte agus tú ag taisteal thar lear

source: Generally speaking, international credit cards and debit cards are the safest way to carry funds when travelling abroad
ga: Go ginearálta, is iad cártaí dochair agus cártaí creidmheasa idirnáisiúnta an bealach is sábháilte le hairgead a iompar nuair a bhíonn tú ag taisteal thar lear

source: In more remote areas, however, you may not be able to use them
ga: I gceantair níos iargúlta, áfach, b’fhéidir nach mbeidh tú in ann iad a úsáid

source: Again, check with your travel agent prior to departure about the best way to carry funds
ga: Arís eile, seiceáil le do ghníomhaire taistil sula bhfágann tú Éire faoin mbealach is fearr le hairgead a iompar

source: It is advisable always to carry a small amount of local currency to pay bus or taxi fares or make small purchases or telephone calls
ga: Moltar méid beag den airgeadra áitiúil a iompar chun íoc as táillí bus nó tacsaí nó chun ceannaigh bheaga nó glaonna gutháin a dhéanamh

source: Before you leave Ireland, make a note of the 24-hour emergency number of the bank that issued your credit card/debit card so you can cancel it in the event it is stolen
ga: Sula bhfágann tú Éire, breac síos uimhir éigeandála 24 uair an chloig an bhainc a d’eisigh do chárta creidmheasa nó chárta dochair - ionas gur féidir leat é a chur ar ceal má ghoidtear é

source: If you intend to drive while abroad, make sure that your Irish driving licence is valid and that you bring it with you
ga: Má tá sé beartaithe agat tiomáint fad atá tú thar lear, cinntigh go bhfuil do cheadúnas tiomána Éireannach bailí agus tabhair leat é

source: Some countries outside the European Economic Area (the member states of the European Union, Norway, Iceland and Liechtenstein) may require you to hold an International Driving Permit in addition to your Irish driving licence
ga: D’fhéadfadh roinnt tíortha lasmuigh den Limistéar Eorpach Eacnamaíoch (ballstáit an Aontais Eorpaigh agus an Iorua, an Íoslainn agus Lichtinstéin) dualgas a leagan ort Ceadúnas Tiomána Idirnáisiúnta a bheith agat anuas ar do cheadúnas tiomána Éireannach

source: Always make sure you are properly insured for driving while overseas
ga: Cinntigh i gcónaí go bhfuil an t-árachas ceart agat chun tiomáint fad atá tú thar lear

source: Electrical plugs and sockets in other countries will be different from those in use in Ireland
ga: Beidh plocóidí agus soicéid leictreacha i dtíortha eile éagsúil ó chinn a úsáidtear in Éirinn

source: You may need special adapters to enable you to use electrical appliances you bring from Ireland (such as hair dryers, shavers, etc.)
ga: B'fhéidir go dteastóidh cuibheoirí speisialta uait chun fearais leictreacha a úsáid a thugann tú leat ó Éirinn (ar nós triomadóirí gruaige, bearrthóirí etc.)

source: You can purchase these adapters at airports and in many stores here in Ireland
ga: Féadfaidh tú na cuibheoirí seo a cheannach in aerfoirt agus i mórán siopaí in Éirinn

source: If you are taking a mobile telephone with you, check in advance that it will work in the country to which you are travelling
ga: Má tá guthán póca á thabhairt leat, seiceáil roimh ré go n-oibreoidh sé sa tír a mbeidh tú ag taisteal chuici

source: Roaming charges can be very high and this can make the cost of using an Irish mobile phone abroad very expensive
ga: Is féidir le táillí fánaíochta bheith an-ard agus tig leis seo costas mór a ghearradh ort as guthán póca Éireannach a úsáid thar lear

source: A price limit called a Eurotariff places a cap on the price you can be charged for using your mobile phone while travelling in the EU
ga: Leagann teorainn phraghais ar a dtugtar taraif Eorpach (Eurotariff) teorainn ar an bpraghas is féidir gearradh ort as do ghuthán póca a úsáid fad atá tú ag taisteal san AE

source: Contact your service provider for more information on the costs of making and receiving calls abroad
ga: Déan teagmháil le do sholáthróir seirbhíse chun tuilleadh faisnéise a fháil ar na costais atá ar ghlaonna a chur agus a fhreagairt thar lear

source: The Department of Foreign Affairs and Trade in Ireland provide travel advice to Irish people planning a trip overseas
ga: Soláthraíonn an Roinn Gnóthaí Eachtracha agus Trádála in Éirinn comhairle thaistil d'Éireannaigh a bhfuil sé beartaithe acu turas a thabhairt thar lear

source: This advice reflects a considered assessment of the risks involved for Irish citizens travelling to individual countries
ga: Cuireann an chomhairle seo measúnú breithnithe ar na rioscaí atá ann do shaoránaigh Éireannacha a thaistealaíonn go tíortha ar leith san áireamh

source: While you are abroad
ga: Fad atá tú thar lear

source: Make a note of the address, telephone number and opening hours of the Irish Embassy or Consulate in the country you are visiting
ga: Breac síos seoladh, uimhir ghutháin agus uaireanta oscailte Ambasáid nó Chonsalacht na hÉireann sa tír ina bhfuil cuairt á tabhairt agat uirthi

source: In countries where there is no Irish diplomatic or consular representation, you may seek emergency assistance from embassies or consulates of other European Union countries
ga: I dtíortha nach bhfuil aon ionadaíocht taidhleoireachta nó chonsalachta ag Éirinn, is féidir cúnamh éigeandála a fháil ó ambasáidí nó ó chonsalachtaí thíortha eile an Aontais Eorpaigh

source: It's always advisable when travelling outside Ireland to plan your travels in advance
ga: Moltar i gcónaí go ndéanann tú do thaisteal a phleanáil roimh ré nuair a bhíonn tú ag taisteal lasmuigh d’Éirinn

source: This will save considerable time when you get there and will help make your time abroad a positive experience
ga: Déanfaidh seo go leor ama a shábháil ort nuair a bhaineann tú an áit amach agus cruthóidh sé eispéireas níos dearfaí duit de do chuid ama thar lear

source: Remember to let family and friends in Ireland know where you are and when they can expect to hear from you
ga: Cuimhnigh insint do do theaghlach agus do do chairde in Éirinn cá bhfuil tú agus cathain is féidir leo bheith ag súil leis cloisteáil uait

source: This will mean that they can also contact you in case there is an emergency
ga: Ciallaíonn seo gur féidir leo teagmháil a dhéanamh leat, chomh maith, sa chás go bhfuil éigeandáil i gceist

source: On its website, the Department of Foreign Affairs and Trade provides advice on what to do to stay safe while abroad and what to do in an emergency
ga: Soláthraíonn an Roinn Gnóthaí Eachtracha agus Trádála comhairle faoi bheith sábháilte thar lear agus céard is ceart a dhéanamh i gcás éigeandála? ar a láithreán gréasáin

source: The Department has also developed a free smartphone app called TravelWise which has travel advice and consular information on 200 countries. The app is available from the Apple and Android stores. Contact Department of Foreign Affairs and Trade 80 St
ga: Forbraíodh an Roinn aip fóin cliste saor in aisce ar a dtugtar TravelWise go bhfuil comhairle taistil agus faisnéis chonsalach le haghaidh 200 tír aici
